uhnp/src/DataProcessors/тн_ВыгрузкаОстатковОСНМА/тн_ВыгрузкаОстатковОСНМА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_ВыгрузкаОстатковОСНМА</name>
  <comment>// Иванов Василий 06.02.2025 Выполнение задач №000052552</comment>
</mdclass:DataProcessor>

uhnp/src/Enums/ВидыВнеоборотныхАктивов/ВидыВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВнеоборотныхАктивов</name>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ИнвестиционноеИмущество</name>
  </enumValues>
  <enumValues>
    <name>ОсновныеСредстваПредоставляемыеВАренду</name>
  </enumValues>
  <enumValues>
    <name>НМА</name>
  </enumValues>
  <enumValues>
    <name>НИОКР</name>
  </enumValues>
  <enumValues>
    <name>ТемыЭтапыИсследованийИРазработок</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВариантыРаздельногоУчетаНДС/ВариантыРаздельногоУчетаНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРаздельногоУчетаНДС</name>
  <enumValues>
    <name>ИзДокумента</name>
  </enumValues>
  <enumValues>
    <name>Распределение</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>РеализацияРаботУслугНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаПоПатенту</name>
  </enumValues>
  <enumValues>
    <name>РеверсивноеОбложениеНДС</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДССМежценовойРазницы</name>
  </enumValues>
  <enumValues>
    <name>Космос</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДСВСтранеЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ЛьготноеНалогообложениеНДСНаУСН</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПорядокПогашенияСтоимостиОС/ПорядокПогашенияСтоимостиОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокПогашенияСтоимостиОС</name>
  <enumValues>
    <name>НачислениеАмортизации</name>
  </enumValues>
  <enumValues>
    <name>НачислениеИзноса</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьНеПогашается</name>
  </enumValues>
  <enumValues>
    <name>НачислениеИзносаПоЕНАОФ</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПриПринятииКУчету</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияНачислена</name>
  </enumValues>
  <enumValues>
    <name>НеПриниматьКУчетуВключитьВРасходы</name>
  </enumValues>
  <enumValues>
    <name>НачислитьАмортизациюПриПринятииКУчету</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПорядокВключенияСтоимостиОСВСоставРасходовНУ/ПорядокВключенияСтоимостиОСВСоставРасходовНУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокВключенияСтоимостиОСВСоставРасходовНУ</name>
  <enumValues>
    <name>НачислениеАмортизации</name>
  </enumValues>
  <enumValues>
    <name>ВключениеВРасходыПриПринятииКУчету</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьНеВключаетсяВРасходы</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияНачислена</name>
  </enumValues>
  <enumValues>
    <name>ВключитьВСоставАмортизируемогоИмущества</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииИлиСписаниеНаРасходы</name>
  </enumValues>
  <enumValues>
    <name>НеПриниматьКУчетуВключитьВРасходы</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПорядокУчетаСтоимостиВнеоборотныхАктивов/ПорядокУчетаСтоимостиВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокУчетаСтоимостиВнеоборотныхАктивов</name>
  <enumValues>
    <name>НачислятьАмортизацию</name>
  </enumValues>
  <enumValues>
    <name>НеНачислятьАмортизацию</name>
  </enumValues>
  <enumValues>
    <name>СписыватьПриПринятииКУчету</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияНачислена</name>
  </enumValues>
  <enumValues>
    <name>НачислитьАмортизациюПриПринятииКУчету</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииИлиСписаниеНаРасходы</name>
  </enumValues>
  <enumValues>
    <name>НеПриниматьКУчетуВключитьВРасходы</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ГруппыОС/ГруппыОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппыОС</name>
  <enumValues>
    <name>Здания</name>
  </enumValues>
  <enumValues>
    <name>Сооружения</name>
  </enumValues>
  <enumValues>
    <name>МашиныИОборудование</name>
  </enumValues>
  <enumValues>
    <name>ОфисноеОборудование</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныеСредства</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственныйИХозяйственныйИнвентарь</name>
  </enumValues>
  <enumValues>
    <name>РабочийСкот</name>
  </enumValues>
  <enumValues>
    <name>ПродуктивныйСкот</name>
  </enumValues>
  <enumValues>
    <name>МноголетниеНасаждения</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныеУчастки</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыПриродопользования</name>
  </enumValues>
  <enumValues>
    <name>КапитальныеВложенияВАрендованноеИмущество</name>
  </enumValues>
  <enumValues>
    <name>ПрочееИмуществоТребующееГосударственнойРегистрации</name>
  </enumValues>
  <enumValues>
    <name>ДругиеВидыОсновныхСредств</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/НематериальныеАктивы/НематериальныеАктивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НематериальныеАктивы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНМА</name>
    <type>
      <types>CatalogRef.ГруппыНМА</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНМА</name>
    <type>
      <types>EnumRef.ВидыНМА</types>
    </type>
  </attributes>
  <attributes>
    <name>АмортизационнаяГруппа</name>
    <type>
      <types>EnumRef.АмортизационныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеСведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаУчета</name>
    <type>
      <types>EnumRef.ВидыОбъектовУчетаНМА</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистрацииНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПраваСобственности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеВНА</name>
    <type>
      <types>CatalogRef.НазначенияВНА</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорАренды</name>
    <type>
      <types>DefinedType.ДоговорыАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИнвентарныйНомерМСФО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистрацииДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистрацииНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКодОКВЭД2</name>
    <type>
      <types>CatalogRef.КлассификаторОКВЭД2</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_МодернизируемыйОбъект</name>
    <comment>//Качикина 27.11.2024 Выполнение задач №000050695</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ПериодичностьМодернизации</name>
    <comment>//Качикина 27.11.2024 Выполнение задач №000050695</comment>
    <type>
      <types>EnumRef.тн_ПериодичностьМодернизации</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ПроизвольнаяДатаМодернизации</name>
    <comment>//Качикина 27.11.2024 Выполнение задач №000050695</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Страхование</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/тн_ВыгрузкаОстатковОСНМА/Forms/ФормаУФ/Module.bsl
// Белоконенко Денис 15.07.2024 Выполнение задач №000050219
//&НаСервереБезКонтекста
&НаСервере
Процедура ЗагрузитьНаСервере(АдресХранилища, ДатаДокументов)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ВремИмяФайла = ПолучитьИмяВременногоФайла(".xlsx");
	ДвоичныеДанные.Записать(ВремИмяФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ВремИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокумент.Область(4,2, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
	Построитель.Выполнить();
	ТаблицаЗначений = Построитель.Результат.Выгрузить();
	УдалитьФайлы(ВремИмяФайла);
	
	ДокументОбъект = Неопределено;
	ЭтоОС = Неопределено;
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//ТекущаяДата = ТекущаяДата(); 
	ТекущаяДата = ТекущаяДатаСервера(); 
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	// НАЧАЛО Белоконенко Денис 15.07.2024 Выполнение задач №000050219
	//Дата = ?(ЗначениеЗаполнено(ДатаДокументов),КонецДня(ДатаДокументов), ТекущаяДата);
	Дата = ?(ЗначениеЗаполнено(ДатаДокументов), ДатаДокументов, ТекущаяДата);
	// КОНЕЦ Белоконенко Денис 15.07.2024 Выполнение задач №000050219
	Комментарий = "#Перенос остатков ОС и НМА "+ТекущаяДата;		
	УправленческаяОрганизация = Справочники.Организации.УправленческаяОрганизация;
	ГруппаФинансовогоУчетаОС = ПолучитьГруппуФинансовогоУчета("ОС", Перечисления.ВидыВнеоборотныхАктивов.ОсновноеСредство);
	ГруппаФинансовогоУчетаНМА = ПолучитьГруппуФинансовогоУчета("НМА", Перечисления.ВидыВнеоборотныхАктивов.НМА);
	ГруппаФинансовогоУчетаНИКОР = ПолучитьГруппуФинансовогоУчета("НИКОР", Перечисления.ВидыВнеоборотныхАктивов.НИОКР);
	// НАЧАЛО Белоконенко Денис 11.04.2025 Выполнение задач №000053383
	//СтруктураЗаполнения = Новый Структура("Организация, Местонахождение, ОтражатьВБУиНУ, ОтражатьВУУ, ХозяйственнаяОперация, Комментарий, Завершен",
	//		,,,,,Комментарий, Ложь); 
	СтруктураЗаполнения = Новый Структура(
		"Организация, Местонахождение, ОтражатьВБУиНУ, ОтражатьВРеглУчете, ОтражатьВУУ, ОтражатьВУпрУчете, ОтражатьВБУ, ОтражатьВНУ, ХозяйственнаяОперация, тн_ОперацияМСФО, Комментарий, Завершен",
			,,,,,,,,,,Комментарий, Ложь);	
	// КОНЕЦ Белоконенко Денис 11.04.2025 Выполнение задач №000053383
			
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("ДокументОбъект");
	Для Каждого КлючИЗначение Из СтруктураЗаполнения Цикл
		ТаблицаДокументов.Колонки.Добавить(КлючИЗначение.Ключ);	
	КонецЦикла;
	
	Для Каждого Стр Из ТаблицаЗначений Цикл
		
		Если ПустаяСтрока(Стр.ОбъектУчета) Тогда
			Продолжить;
		КонецЕсли;
		
		//Если здесь нули или минусовые значения, в документ ничего заполнить не удастся - пропускаем
		ТекущаяСтоимостьБУ = ПреобразоватьЗначениеИзСтроки(Стр.ТекущаяСтоимостьБУ);
		ТекущаяСтоимостьНУ = ПреобразоватьЗначениеИзСтроки(Стр.ТекущаяСтоимостьНУ);
		ТекущаяСтоимостьУУ = ПреобразоватьЗначениеИзСтроки(Стр.ТекущаяСтоимостьУУ);
				
		Если ТекущаяСтоимостьБУ<= 0 
			И ТекущаяСтоимостьНУ <= 0
			И ТекущаяСтоимостьУУ <= 0 Тогда
			Продолжить;
		КонецЕсли; 			
		
		//Заполняются основные реквизиты для определения документа
		ЭтоОС = Стр.ЭтоОС = "Да";
		Если ЭтоОС Тогда
			СтруктураЗаполнения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковОсновныхСредств; 
		Иначе
			СтруктураЗаполнения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковНМАиРасходовНаНИОКР;			
		КонецЕсли;
		
		// НАЧАЛО Белоконенко Денис 11.04.2025 Выполнение задач №000053383
		//Если ПустаяСтрока(Стр.НачислятьАмортизациюБУ)
		//	 И ПустаяСтрока(Стр.НачислятьАмортизациюНУ) Тогда
		//	ОтражатьВБУиНУ = Ложь;
		//	ОтражатьВРеглУчете = Ложь;
		//	//ОтражатьВОперативномУчете = Ложь;
		//Иначе
		//	ОтражатьВБУиНУ = Истина;
		//	ОтражатьВРеглУчете = Истина;
		//	//ОтражатьВОперативномУчете = Истина;
		//КонецЕсли;
		//Если ПустаяСтрока(Стр.НачислятьАмортизациюУУ) Тогда
		//	ОтражатьВУУ = Ложь;
		//	ОтражатьВУпрУчете = Ложь;
		//	//ОтражатьВОперативномУчете = Ложь;
		//Иначе
		//	ОтражатьВУУ = Истина;
		//	ОтражатьВУпрУчете = Истина;
		//	//ОтражатьВОперативномУчете = Истина;
		//КонецЕсли;  
		
		СтруктураЗаполнения.тн_ОперацияМСФО = ПреобразоватьЗначениеИзСтроки(Стр.ОперацияМСФО, "Перечисление", "тн_ОперацияМСФО");
		
		ОтраженВБУ = ПреобразоватьЗначениеИзСтроки(Стр.ОтраженВБУ, "Булево");
		ОтраженВНУ = ПреобразоватьЗначениеИзСтроки(Стр.ОтраженВНУ, "Булево");
		ОтраженВУУ = ПреобразоватьЗначениеИзСтроки(Стр.ОтраженВУУ, "Булево");
		
		Если Не ОтраженВБУ И Не ОтраженВНУ Тогда
			ОтражатьВБУиНУ = Ложь;
			ОтражатьВРеглУчете = Ложь;
		Иначе
			ОтражатьВБУиНУ = Истина;
			ОтражатьВРеглУчете = Истина;			
		КонецЕсли;  
				
		ОтражатьВУпрУчете 	= ОтраженВУУ;
		ОтражатьВУУ 		= ОтраженВУУ;
		
		СтруктураЗаполнения.ОтражатьВБУ			= ОтраженВБУ;
		СтруктураЗаполнения.ОтражатьВНУ			= ОтраженВНУ;
		СтруктураЗаполнения.ОтражатьВРеглУчете 	= ОтражатьВРеглУчете;
		СтруктураЗаполнения.ОтражатьВУпрУчете 	= ОтражатьВУпрУчете;
		// КОНЕЦ Белоконенко Денис 11.04.2025 Выполнение задач №000053383		
		СтруктураЗаполнения.ОтражатьВБУиНУ = ОтражатьВБУиНУ;
		СтруктураЗаполнения.ОтражатьВУУ = ОтражатьВУУ;
		
		Если ЗначениеЗаполнено(Стр.Организация) Тогда
			Организация = ПреобразоватьЗначениеИзСтроки(Стр.Организация, "Справочник", "Организации");
		Иначе
			Организация = УправленческаяОрганизация;
		КонецЕсли;		
		СтруктураЗаполнения.Организация = Организация;
		ПодразделениеБУ = ПреобразоватьЗначениеИзСтроки(Стр.ПодразделениеБУ, "Справочник", "СтруктураПредприятия");
		ПодразделениеУУ = ПреобразоватьЗначениеИзСтроки(Стр.ПодразделениеУУ, "Справочник", "СтруктураПредприятия");
		СтатьяПодразделениеБУ = ПреобразоватьЗначениеИзСтроки(Стр.СтатьяПодразделениеБУ, "Справочник", "СтруктураПредприятия");
		СтатьяПодразделениеУУ = ПреобразоватьЗначениеИзСтроки(Стр.СтатьяПодразделениеУУ, "Справочник", "СтруктураПредприятия");
		// НАЧАЛО Белоконенко Денис 08.09.2023 Выполнение задач №000046788
		//СтруктураЗаполнения.Местонахождение = ?(ЗначениеЗаполнено(ПодразделениеУУ), ПодразделениеУУ, ПодразделениеБУ);
		Если Стр.ЭтоБазаПП Тогда
			СтруктураЗаполнения.Местонахождение = ПодразделениеБУ;
		Иначе
			СтруктураЗаполнения.Местонахождение = ?(ЗначениеЗаполнено(ПодразделениеУУ), ПодразделениеУУ, ПодразделениеБУ);
		КонецЕсли;	
		// КОНЕЦ Белоконенко Денис 08.09.2023 Выполнение задач №000046788
		// НАЧАЛО Белоконенко Денис 15.07.2024 Выполнение задач №000050219
		ПодразделениеСлужебноеУУ = ПреобразоватьЗначениеИзСтроки(Стр.ПодразделениеСлужебное, "Справочник", "СтруктураПредприятия");
		Если ПриоритетУУ Тогда
			СтруктураЗаполнения.Местонахождение =  ?(ЗначениеЗаполнено(ПодразделениеУУ), ПодразделениеУУ, ПодразделениеСлужебноеУУ);	
		КонецЕсли;
		// КОНЕЦ Белоконенко Денис 15.07.2024 Выполнение задач №000050219
		
		//поиск документа
		НайденыДокументы = ТаблицаДокументов.НайтиСтроки(СтруктураЗаполнения);
		Если НайденыДокументы.Количество() = 0 Тогда
			ДокументОбъект = Документы.ВводОстатковВнеоборотныхАктивов2_4.СоздатьДокумент();
			ДокументОбъект.Заполнить(Новый Структура("Дата, Местонахождение, ХозяйственнаяОперация",
						Дата, СтруктураЗаполнения.Местонахождение, СтруктураЗаполнения.ХозяйственнаяОперация));
			ЗаполнитьЗначенияСвойств(ДокументОбъект, СтруктураЗаполнения);
			ДокументОбъект.ОтражатьВОперативномУчете = Истина; //ОтражатьВУУ;
			ДокументОбъект.ОтражатьВРеглУчете = ОтражатьВБУиНУ;
			ДокументОбъект.ОтражатьВУпрУчете = ОтражатьВУУ;
			ТекДокСтр = ТаблицаДокументов.Добавить();
			ТекДокСтр.ДокументОбъект = ДокументОбъект;
			ЗаполнитьЗначенияСвойств(ТекДокСтр, СтруктураЗаполнения);
		Иначе
			ТекДокСтр = НайденыДокументы[0];
			ДокументОбъект = ТекДокСтр.ДокументОбъект;
		КонецЕсли;
		
		//Заполнение табличной части
		
		//Поиск объекта учета
		ОбъектУчета = ПолучитьОбъектУчета(Стр, ЭтоОС);
		
		НачислятьАмортизациюБУ = ПреобразоватьЗначениеИзСтроки(Стр.НачислятьАмортизациюБУ, "Булево");
		НачислятьАмортизациюНУ = ПреобразоватьЗначениеИзСтроки(Стр.НачислятьАмортизациюНУ, "Булево");
		НачислятьАмортизациюУУ = ПреобразоватьЗначениеИзСтроки(Стр.НачислятьАмортизациюУУ, "Булево");

		Если ЭтоОС Тогда
			НовСтр = ДокументОбъект.ОС.Добавить();
			НовСтр.ОсновноеСредство = ОбъектУчета;
			// НАЧАЛО Белоконенко Денис 20.11.2023 Выполнение задач №000046788
			НовСтр.ВариантРаздельногоУчетаНДС 	= Перечисления.ВариантыРаздельногоУчетаНДС.ИзДокумента; 
			НовСтр.НалогообложениеНДС			= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			// КОНЕЦ Белоконенко Денис 20.11.2023 Выполнение задач №000046788
			НовСтр.Подразделение = СтруктураЗаполнения.Местонахождение;			
			// НАЧАЛО Белоконенко Денис 16.05.2025 Выполнение задач №000053714
			//МОЛБУ = ПреобразоватьЗначениеИзСтроки(Стр.МОЛБУ, "Справочник", "ФизическиеЛица");
			//МОЛУУ = ПреобразоватьЗначениеИзСтроки(Стр.МОЛУУ, "Справочник", "ФизическиеЛица");			
			МОЛБУ = Справочники.ФизическиеЛица.ПолучитьФизЛицоСсылка(Стр.МОЛ_ЕКС_БУ);
			МОЛУУ = Справочники.ФизическиеЛица.ПолучитьФизЛицоСсылка(Стр.МОЛ_ЕКС_УУ);			
			// КОНЕЦ Белоконенко Денис 16.05.2025 Выполнение задач №000053714
			НовСтр.МОЛ = ?(ЗначениеЗаполнено(МОЛБУ), МОЛБУ, МОЛУУ);
			НовСтр.МетодНачисленияАмортизацииБУ = ПреобразоватьЗначениеИзСтроки(Стр.МетодНачисленияАмортизацииБУ, "Перечисление", "СпособыНачисленияАмортизацииОС");
			НовСтр.МетодНачисленияАмортизацииУУ = ПреобразоватьЗначениеИзСтроки(Стр.МетодНачисленияАмортизацииУУ, "Перечисление", "СпособыНачисленияАмортизацииОС");
			Если НачислятьАмортизациюБУ Тогда
				НовСтр.ПорядокУчетаБУ = Перечисления.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации;
			Иначе
				НовСтр.ПорядокУчетаБУ = Перечисления.ПорядокПогашенияСтоимостиОС.СтоимостьНеПогашается;	
			КонецЕсли;
			НовСтр.ПорядокУчетаНУ = ПреобразоватьЗначениеИзСтроки(Стр.МетодНачисленияАмортизацииНУ, "Перечисление", "ПорядокВключенияСтоимостиОСВСоставРасходовНУ");			
			
			Если Не ЗначениеЗаполнено(НовСтр.ПорядокУчетаНУ) Тогда
				Если НачислятьАмортизациюНУ Тогда
					НовСтр.ПорядокУчетаНУ = Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации;
				Иначе
					НовСтр.ПорядокУчетаНУ = Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.СтоимостьНеВключаетсяВРасходы;	
				КонецЕсли;
			КонецЕсли;
			Если НачислятьАмортизациюУУ Тогда
				НовСтр.ПорядокУчетаУУ = Перечисления.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию;
			Иначе
				НовСтр.ПорядокУчетаУУ = Перечисления.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеНачислятьАмортизацию;	
			КонецЕсли;
			// НАЧАЛО Белоконенко Денис 08.09.2023 Выполнение задач №000046788
			НовСтр.АмортизационнаяГруппа = ПреобразоватьЗначениеИзСтроки(
					Стр.ОбъектУчетаАмортизационнаяГруппа, "Перечисление", "АмортизационныеГруппы");
			// КОНЕЦ Белоконенко Денис 08.09.2023 Выполнение задач №000046788 
			// НАЧАЛО Белоконенко Денис 15.07.2024 Выполнение задач №000050219
			НовСтр.НачислятьАмортизациюБУ = НачислятьАмортизациюБУ;
			НовСтр.НачислятьАмортизациюНУ = НачислятьАмортизациюНУ;
			НовСтр.НачислятьАмортизациюУУ = НачислятьАмортизациюУУ;
			
			ГруппаОС = Стр.ОбъектУчетаГруппаОС;
			
			Если ГруппаОС = "Здания" или ГруппаОС = "Сооружения" Тогда
				НовСтр.НедвижимоеИмущество = Истина;
			Иначе
				НовСтр.НедвижимоеИмущество = Ложь;
			КонецЕсли;	
			// КОНЕЦ Белоконенко Денис 15.07.2024 Выполнение задач №000050219			
		Иначе
			НовСтр = ДокументОбъект.НМА.Добавить();
			НовСтр.НематериальныйАктив = ОбъектУчета; 
			// НАЧАЛО Белоконенко Денис 11.04.2025 Выполнение задач №000053383  		
			НовСтр.ВариантРаздельногоУчетаНДС 	= Перечисления.ВариантыРаздельногоУчетаНДС.ИзДокумента; 
			НовСтр.НалогообложениеНДС			= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			// КОНЕЦ Белоконенко Денис 11.04.2025 Выполнение задач №000053383			
			ДатаПриобретенияБУ = ПреобразоватьЗначениеИзСтроки(Стр.ДатаПриобретенияБУ, "Дата");
			ДатаПриобретенияУУ = ПреобразоватьЗначениеИзСтроки(Стр.ДатаПриобретенияУУ, "Дата");
			НовСтр.ДатаПриобретения = ?(ЗначениеЗаполнено(ДатаПриобретенияБУ), ДатаПриобретенияБУ, ДатаПриобретенияУУ); 
			НовСтр.МетодНачисленияАмортизацииБУ = ПреобразоватьЗначениеИзСтроки(Стр.МетодНачисленияАмортизацииБУ, "Перечисление", "СпособыНачисленияАмортизацииНМА");
			НовСтр.МетодНачисленияАмортизацииУУ = ПреобразоватьЗначениеИзСтроки(Стр.МетодНачисленияАмортизацииУУ, "Перечисление", "СпособыНачисленияАмортизацииНМА");
			НовСтр.МетодНачисленияАмортизацииНУ = ПреобразоватьЗначениеИзСтроки(Стр.МетодНачисленияАмортизацииБУ, "Перечисление", "МетодыНачисленияАмортизации");
			Если НачислятьАмортизациюБУ Тогда
				НовСтр.ПорядокУчетаБУ = Перечисления.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию;
			Иначе
				НовСтр.ПорядокУчетаБУ = Перечисления.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеНачислятьАмортизацию;	
			КонецЕсли;
			Если НачислятьАмортизациюНУ Тогда
				НовСтр.ПорядокУчетаНУ = Перечисления.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию;
			Иначе
				НовСтр.ПорядокУчетаНУ = Перечисления.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеНачислятьАмортизацию;	
			КонецЕсли;
			Если НачислятьАмортизациюУУ Тогда
				НовСтр.ПорядокУчетаУУ = Перечисления.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию;
			Иначе
				НовСтр.ПорядокУчетаУУ = Перечисления.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеНачислятьАмортизацию;	
			КонецЕсли; 
			// НАЧАЛО Белоконенко Денис 15.07.2024 Выполнение задач №000050219
			НовСтр.НачислятьАмортизациюНУ 			= НачислятьАмортизациюНУ;
			// КОНЕЦ Белоконенко Денис 15.07.2024 Выполнение задач №000050219			
		КонецЕсли;
		
		// НАЧАЛО Белоконенко Денис 15.07.2024 Выполнение задач №000050219
		//НовСтр.НачислятьАмортизациюБУ = НачислятьАмортизациюБУ;
		//НовСтр.НачислятьАмортизациюНУ = НачислятьАмортизациюНУ;
		//НовСтр.НачислятьАмортизациюУУ = НачислятьАмортизациюУУ;
		// КОНЕЦ Белоконенко Денис 15.07.2024 Выполнение задач №000050219
		
		НовСтр.ДатаПринятияКУчетуБУ = ПреобразоватьЗначениеИзСтроки(Стр.ДатаПринятияКУчетуБУ, "Дата");
		НовСтр.ДатаПринятияКУчетуУУ = ПреобразоватьЗначениеИзСтроки(Стр.ДатаПринятияКУчетуУУ, "Дата");
		НовСтр.ЛиквидационнаяСтоимостьРегл = ПреобразоватьЗначениеИзСтроки(Стр.ЛиквидационнаяСтоимость);
		НовСтр.ЛиквидационнаяСтоимость = НовСтр.ЛиквидационнаяСтоимостьРегл;
		// НАЧАЛО Белоконенко Денис 08.09.2023 Выполнение задач №000046788
		НовСтр.ДатаПринятияКУчетуНУ = ПреобразоватьЗначениеИзСтроки(Стр.ДатаПринятияКУчетуБУ, "Дата");
		// КОНЕЦ Белоконенко Денис 08.09.2023 Выполнение задач №000046788		
		
		ГруппаФинансовогоУчета = Неопределено;
		Если ЭтоОС Тогда 
			ГруппаФинансовогоУчета = ГруппаФинансовогоУчетаОС;
		ИначеЕсли Стр.ОбъектУчетаВидОбъектаУчета = "НематериальныйАктив" Тогда
			ГруппаФинансовогоУчета = ГруппаФинансовогоУчетаНМА;	
		ИначеЕсли Стр.ОбъектУчетаВидОбъектаУчета = "РасходыНаНИОКР" Тогда
			ГруппаФинансовогоУчета = ГруппаФинансовогоУчетаНИКОР;	
		КонецЕсли;
		НовСтр.ГруппаФинансовогоУчета = ГруппаФинансовогоУчета;
		
		НовСтр.СпособПоступления = ПреобразоватьЗначениеИзСтроки(Стр.СпособПоступления, "Перечисление", "СпособыПоступленияАктивов");
		 				
		НовСтр.ТекущаяСтоимостьБУ = ТекущаяСтоимостьБУ;
		НовСтр.ТекущаяСтоимостьНУ = ТекущаяСтоимостьНУ;
		НовСтр.ТекущаяСтоимостьУУ = ТекущаяСтоимостьУУ;
		// НАЧАЛО Юдина Екатерина 16.02.2026 Выполнение задач №000056766
		НовСтр.ТекущаяСтоимостьПР = ПреобразоватьЗначениеИзСтроки(Стр.ТекущаяСтоимостьПР);
		// КОНЕЦ Юдина Екатерина 16.02.2026 Выполнение задач №000056766
		
		НовСтр.ПервоначальнаяСтоимостьБУ = ПреобразоватьЗначениеИзСтроки(Стр.ПервоначальнаяСтоимостьБУ);
		НовСтр.ПервоначальнаяСтоимостьНУ = ПреобразоватьЗначениеИзСтроки(Стр.ПервоначальнаяСтоимостьНУ);
		НовСтр.ПервоначальнаяСтоимостьУУ = ПреобразоватьЗначениеИзСтроки(Стр.ПервоначальнаяСтоимостьУУ);
		// НАЧАЛО Юдина Екатерина 16.02.2026 Выполнение задач №000056766
		Если ЭтоОС Тогда
			НовСтр.ПервоначальнаяСтоимостьПР = ПреобразоватьЗначениеИзСтроки(Стр.ТекущаяСтоимостьПР);  
		КонецЕсли;
		// КОНЕЦ Юдина Екатерина 16.02.2026 Выполнение задач №000056766
		
		НовСтр.НакопленнаяАмортизацияБУ = ПреобразоватьЗначениеИзСтроки(Стр.НакопленнаяАмортизацияБУ);
		НовСтр.НакопленнаяАмортизацияНУ = ПреобразоватьЗначениеИзСтроки(Стр.НакопленнаяАмортизацияНУ);
		НовСтр.НакопленнаяАмортизацияУУ = ПреобразоватьЗначениеИзСтроки(Стр.НакопленнаяАмортизацияУУ);
		// НАЧАЛО Юдина Екатерина 16.02.2026 Выполнение задач №000056766
		НовСтр.НакопленнаяАмортизацияПР = ПреобразоватьЗначениеИзСтроки(Стр.НакопленнаяАмортизацияПР);
		// КОНЕЦ Юдина Екатерина 16.02.2026 Выполнение задач №000056766
		
		НовСтр.СрокИспользованияБУ = ПреобразоватьЗначениеИзСтроки(Стр.СрокИспользованияБУ);
		НовСтр.СрокИспользованияНУ = ПреобразоватьЗначениеИзСтроки(Стр.СрокИспользованияНУ);
		НовСтр.СрокИспользованияУУ = ПреобразоватьЗначениеИзСтроки(Стр.СрокИспользованияУУ);
		
		// НАЧАЛО Белоконенко Денис 08.09.2023 Выполнение задач №000046788
		Если НовСтр.ПорядокУчетаНУ = Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ВключениеВРасходыПриПринятииКУчету Тогда
			НовСтр.ТекущаяСтоимостьНУ 			= 0;
			НовСтр.ПервоначальнаяСтоимостьНУ 	= 0;
			НовСтр.НакопленнаяАмортизацияНУ 	= 0;
			НовСтр.СрокИспользованияНУ 			= 0;
		КонецЕсли;	
		// КОНЕЦ Белоконенко Денис 08.09.2023 Выполнение задач №000046788		
		// НАЧАЛО Белоконенко Денис 20.11.2023 Выполнение задач №000046788
		Если Не ЗначениеЗаполнено(НовСтр.ПервоначальнаяСтоимостьУУ) Тогда
			НовСтр.ПервоначальнаяСтоимостьУУ = НовСтр.ПервоначальнаяСтоимостьБУ;	
		КонецЕсли;
		// КОНЕЦ Белоконенко Денис 20.11.2023 Выполнение задач №000046788		
		// НАЧАЛО Белоконенко Денис 20.11.2023 Выполнение задач №000046788
		Если Не ЗначениеЗаполнено(НовСтр.СрокИспользованияУУ) И ЗначениеЗаполнено(НовСтр.СрокИспользованияБУ) Тогда
			НовСтр.СрокИспользованияУУ = НовСтр.СрокИспользованияБУ;	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НовСтр.СрокИспользованияБУ) И ЗначениеЗаполнено(НовСтр.СрокИспользованияУУ) Тогда
			НовСтр.СрокИспользованияБУ = НовСтр.СрокИспользованияУУ;	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НовСтр.СрокИспользованияНУ) И ЗначениеЗаполнено(НовСтр.СрокИспользованияБУ) Тогда
			НовСтр.СрокИспользованияНУ = НовСтр.СрокИспользованияБУ;	
		КонецЕсли;
		// КОНЕЦ Белоконенко Денис 20.11.2023 Выполнение задач №000046788		
		
		НовСтр.СпециальныйКоэффициентНУ = ПреобразоватьЗначениеИзСтроки(Стр.СпециальныйКоэффициентНУ);
		// НАЧАЛО Белоконенко Денис 08.09.2023 Выполнение задач №000046788
		Если Не ЗначениеЗаполнено(НовСтр.СпециальныйКоэффициентНУ) Тогда
			НовСтр.СпециальныйКоэффициентНУ = 1;
		КонецЕсли;
		// КОНЕЦ Белоконенко Денис 08.09.2023 Выполнение задач №000046788
		
		// НАЧАЛО Белоконенко Денис 14.08.2024 Выполнение задач №000050515
		Если ЭтоОС Тогда 
			НовСтр.ЕстьИзменениеПараметровАмортизацииУУ = Истина;
			НовСтр.ДатаИзмененияПараметровУУ = НовСтр.ДатаПринятияКУчетуУУ;
			НовСтр.СтоимостьДляВычисленияАмортизацииУУ = НовСтр.ТекущаяСтоимостьУУ - НовСтр.НакопленнаяАмортизацияУУ;
			НовСтр.СрокИспользованияУУОстаточный = ПреобразоватьЗначениеИзСтроки(Стр.СрокИспользованияДляВычисленияАмортизацииУУ);
			
			// НАЧАЛО Белоконенко Денис 11.04.2025 Выполнение задач №000053383
			ДатаПоследняяМодернизация = ПреобразоватьЗначениеИзСтроки(Стр.ДатаПоследняяМодернизация, "Дата");
			Если ЗначениеЗаполнено(ДатаПоследняяМодернизация) Тогда
				НовСтр.ЕстьИзменениеПараметровАмортизацииБУ = Истина;
				НовСтр.ДатаИзмененияПараметровБУ = ДатаПоследняяМодернизация;
				// НАЧАЛО Белоконенко Денис 17.07.2025 Выполнение задач №000054447
				НовСтр.СтоимостьДляВычисленияАмортизацииБУ = ПреобразоватьЗначениеИзСтроки(Стр.СтоимостьДляВычисленияАмортизацииБУ);
				// КОНЕЦ Белоконенко Денис 17.07.2025 Выполнение задач №000054447
				// НАЧАЛО Белоконенко Денис 20.08.2025 Выполнение задач №000054853
				НовСтр.СрокИспользованияБУОстаточный = НовСтр.СрокИспользованияБУ;
				// КОНЕЦ Белоконенко Денис 20.08.2025 Выполнение задач №000054853
			КонецЕсли;
			// КОНЕЦ Белоконенко Денис 11.04.2025 Выполнение задач №000053383
		КонецЕсли;
		// КОНЕЦ Белоконенко Денис 14.08.2024 Выполнение задач №000050515
		
		// НАЧАЛО Белоконенко Денис 11.04.2025 Выполнение задач №000053383
		//НовСтр.СтатьяРасходовБУ = ТН_Интеграция_ERP_УХ.СтатьяРасходовПоКоду(Стр.ТН_КодСтатьиЕРП_УХ_БУ);
		//НовСтр.СтатьяРасходовУУ = ТН_Интеграция_ERP_УХ.СтатьяРасходовПоКоду(Стр.ТН_КодСтатьиЕРП_УХ_УУ);		
		Если Стр.ОбъектУчетаВидОбъектаУчета = "РасходыНаНИОКР" Тогда			
			НовСтр.НакопленнаяАмортизацияБУ = 0;
			НовСтр.НакопленнаяАмортизацияНУ = 0;
			НовСтр.НакопленнаяАмортизацияУУ = 0;
		КонецЕсли;
		
		НовСтр.СпособОтраженияРасходовБУ = ПреобразоватьЗначениеИзСтроки(Стр.СпособОтраженияПоАмортизацииБУ, "Справочник", "СпособыОтраженияРасходов");
		НовСтр.СпособОтраженияРасходовУУ = ПреобразоватьЗначениеИзСтроки(Стр.СпособОтраженияПоАмортизацииУУ, "Справочник", "СпособыОтраженияРасходов");
		НовСтр.СпособОтраженияРасходовНУ = НовСтр.СпособОтраженияРасходовБУ;
		
		ЗаполнитьРеквизитыПоСпособуРасходов(НовСтр);
		
		СтатьяПодразделениеБУ = НовСтр.ПодразделениеБУ;
		СтатьяПодразделениеУУ = НовСтр.ПодразделениеУУ;
		// КОНЕЦ Белоконенко Денис 11.04.2025 Выполнение задач №000053383
		
		Если ЗначениеЗаполнено(НовСтр.СтатьяРасходовБУ) Тогда
			Если ""+НовСтр.СтатьяРасходовБУ.ТипЗначения = "Подразделение" Тогда
				НовСтр.АналитикаРасходовБУ = СтатьяПодразделениеБУ;
			// НАЧАЛО Белоконенко Денис 08.09.2023 Выполнение задач №000046788
			ИначеЕсли ""+НовСтр.СтатьяРасходовБУ.ТипЗначения = "Объект эксплуатации" Тогда
				НовСтр.АналитикаРасходовБУ = НовСтр.ОсновноеСредство;	
			// КОНЕЦ Белоконенко Денис 08.09.2023 Выполнение задач №000046788				
			Иначе
				ОбщегоНазначения.СообщитьПользователю("Объект учета: " + ОбъектУчета + Символы.ПС
					+ "По статье '" + НовСтр.СтатьяРасходовБУ + "' не установлена аналитика по подразделению!");
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовСтр.СтатьяРасходовУУ) Тогда
			Если ""+НовСтр.СтатьяРасходовУУ.ТипЗначения = "Подразделение" Тогда
				НовСтр.АналитикаРасходовУУ = СтатьяПодразделениеУУ;
			// НАЧАЛО Белоконенко Денис 08.09.2023 Выполнение задач №000046788
			ИначеЕсли ""+НовСтр.СтатьяРасходовУУ.ТипЗначения = "Объект эксплуатации" Тогда
				НовСтр.АналитикаРасходовУУ = НовСтр.ОсновноеСредство;	
			// КОНЕЦ Белоконенко Денис 08.09.2023 Выполнение задач №000046788
			Иначе
				ОбщегоНазначения.СообщитьПользователю("Объект учета: " + ОбъектУчета + Символы.ПС
					+ "По статье '" + НовСтр.СтатьяРасходовУУ + "' не установлена аналитика по подразделению!");
			КонецЕсли;
		КонецЕсли;
								
		Если ДокументОбъект.ОС.Количество() > 9999 
			ИЛИ ДокументОбъект.НМА.Количество() > 9999 Тогда
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение					
				ДокументОбъект.ОбменДанными.Загрузка = Истина;
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				ОбщегоНазначения.СообщитьПользователю("Ошибка записи документа " + ДокументОбъект.Ссылка, ДокументОбъект.Ссылка);
			КонецПопытки;
			ТекДокСтр.Завершен = Истина;
		КонецЕсли;
		
	КонецЦикла;
		
	Для Каждого ТекДокСтр Из ТаблицаДокументов Цикл
		ДокументОбъект = ТекДокСтр.ДокументОбъект;
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокументОбъект.УстановитьНовыйНомер();
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначения.СообщитьПользователю("Ошибка проведения документа " + ДокументОбъект.Ссылка, ДокументОбъект.Ссылка);
		КонецПопытки;
	КонецЦикла;
		
	ОбщегоНазначения.СообщитьПользователю("Загрузка завершена. Создано документов: " + ТаблицаДокументов.Количество());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГруппуФинансовогоУчета(Наименование, ВидАктива)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГруппыФинансовогоУчетаВнеоборотныхАктивов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов КАК ГруппыФинансовогоУчетаВнеоборотныхАктивов
		|ГДЕ
		|	ГруппыФинансовогоУчетаВнеоборотныхАктивов.Наименование ПОДОБНО &Наименование
		|	И ГруппыФинансовогоУчетаВнеоборотныхАктивов.ВидАктива = &ВидАктива";
	
	Запрос.УстановитьПараметр("ВидАктива", ВидАктива);
	Запрос.УстановитьПараметр("Наименование", Наименование + "%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПреобразоватьЗначениеИзСтроки(СтрЗначение, Тип="Число", Вид="")

	Если ПустаяСтрока(СтрЗначение) И Не Тип="Булево"Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	// НАЧАЛО Белоконенко Денис 13.10.2025 Выполнение задач №000055468
	Попытка
	// КОНЕЦ Белоконенко Денис 13.10.2025 Выполнение задач №000055468
		Если Тип = "Дата" Тогда
			Результат = Дата(СтрЗначение);	
		ИначеЕсли Тип = "Число" Тогда
			Результат = Число(СтрЗаменить(СтрЗначение, " ", ""));
		ИначеЕсли Тип = "Булево" Тогда
			Результат = СтрЗначение = "Да" ИЛИ СтрЗначение = "Истина" ИЛИ СтрЗначение = "+" ИЛИ СтрЗначение = "1";
		ИначеЕсли Тип = "Перечисление" Тогда
			Результат = Перечисления[Вид][СтрЗначение];
		ИначеЕсли Тип = "Справочник" Тогда
			Результат = Справочники[Вид].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрЗначение));
		Иначе
			Результат = СтрЗначение;
		КонецЕсли;
	// НАЧАЛО Белоконенко Денис 13.10.2025 Выполнение задач №000055468
	Исключение
	 	Возврат Неопределено;
	КонецПопытки;
	// КОНЕЦ Белоконенко Денис 13.10.2025 Выполнение задач №000055468		
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОбъектУчета(СтрДанные, ЭтоОС)
	
	Результат = Неопределено;
	
	Если ЭтоОС Тогда
		Результат = ПреобразоватьЗначениеИзСтроки(СтрДанные.ОбъектУчета, "Справочник", "ОбъектыЭксплуатации");	
	Иначе
		Результат = ПреобразоватьЗначениеИзСтроки(СтрДанные.ОбъектУчета, "Справочник", "НематериальныеАктивы");		
	КонецЕсли;
	
	//Проверка на пустую ссылку или объект не найден
	Если Не (Результат.Пустая()
		ИЛИ Результат.ПолучитьОбъект() = Неопределено) Тогда
		Возврат Результат;	
	КонецЕсли;
	
	Если ЭтоОС Тогда
		НовОбъектУчета = Справочники.ОбъектыЭксплуатации.СоздатьЭлемент();
		НовОбъектУчета.УстановитьСсылкуНового(Результат);
		НовОбъектУчета.Код = СокрЛП(СтрДанные.ОбъектУчетаКод);
		НовОбъектУчета.ИнвентарныйНомер = НовОбъектУчета.Код;
		НовОбъектУчета.Наименование = СтрДанные.ОбъектУчетаНаименование;
		НовОбъектУчета.Изготовитель = СтрДанные.ОбъектУчетаИзготовитель;
		НовОбъектУчета.НомерПаспорта = СтрДанные.ОбъектУчетаНомерПаспорта;
		НовОбъектУчета.ЗаводскойНомер = СтрДанные.ОбъектУчетаЗаводскойНомер;
		НовОбъектУчета.ДатаВыпуска = ПреобразоватьЗначениеИзСтроки(СтрДанные.ОбъектУчетаДатаВыпуска, "Дата"); 		
		
		//КодПоОКОФ
		Если Не ПустаяСтрока(СтрДанные.ОбъектУчетаКодПоОКОФ) Тогда
			НовОбъектУчета.КодПоОКОФ = Справочники.ОбщероссийскийКлассификаторОсновныхФондов.НайтиПоКоду(СокрЛП(СтрДанные.ОбъектУчетаКодПоОКОФ));
		КонецЕсли;
		
		// НАЧАЛО Белоконенко Денис 15.07.2024 Выполнение задач №000050219
		////АмортизационнаяГруппа
		//// НАЧАЛО Белоконенко Денис 08.09.2023 Выполнение задач №000046788
		////НовОбъектУчета.АмортизационнаяГруппа = ПреобразоватьЗначениеИзСтроки(
		////		СтрДанные.ОбъектУчетаАмортизационнаяГруппа, "Перечисление", "АмортизационныеГруппы");
		//НовОбъектУчета.УдалитьАмортизационнаяГруппа = ПреобразоватьЗначениеИзСтроки(
		//		СтрДанные.ОбъектУчетаАмортизационнаяГруппа, "Перечисление", "АмортизационныеГруппы");
		//// КОНЕЦ Белоконенко Денис 08.09.2023 Выполнение задач №000046788
		// КОНЕЦ Белоконенко Денис 15.07.2024 Выполнение задач №000050219
				
		//ГруппаОС
		ГруппаОС = СтрДанные.ОбъектУчетаГруппаОС;
		//ПередаточныеУстройства, МалоценныеНеоборотныеМА, БиблиотечныеФонды в ДругиеВидыОсновныхСредств. 
		//ДвижимыеЗдания - Здания, ДвижимыеСооружения - Сооружения
		
		// НАЧАЛО Белоконенко Денис 15.07.2024 Выполнение задач №000050219
		//Если ГруппаОС = "Здания" или ГруппаОС = "Сооружения" Тогда
		//	НовОбъектУчета.НедвижимоеИмущество = Истина;
		//КонецЕсли;
		//
		//Если ГруппаОС = "ПередаточныеУстройства" или ГруппаОС = "МалоценныеНеоборотныеМА" или ГруппаОС = "БиблиотечныеФонды" Тогда
		//	НовОбъектУчета.ГруппаОС = Перечисления.ГруппыОС.ДругиеВидыОсновныхСредств;			
		//ИначеЕсли ГруппаОС = "ДвижимыеЗдания" Тогда
		//	НовОбъектУчета.ГруппаОС = Перечисления.ГруппыОС.Здания;
		//	НовОбъектУчета.НедвижимоеИмущество = Ложь;		
		//ИначеЕсли ГруппаОС = "ДвижимыеСооружения" Тогда
		//	НовОбъектУчета.ГруппаОС = Перечисления.ГруппыОС.Сооружения;
		//	НовОбъектУчета.НедвижимоеИмущество = Ложь;
		
		Если ГруппаОС = "ПередаточныеУстройства" или ГруппаОС = "МалоценныеНеоборотныеМА" или ГруппаОС = "БиблиотечныеФонды" Тогда
			НовОбъектУчета.ГруппаОС = Перечисления.ГруппыОС.ДругиеВидыОсновныхСредств;			
		ИначеЕсли ГруппаОС = "ДвижимыеЗдания" Тогда
			НовОбъектУчета.ГруппаОС = Перечисления.ГруппыОС.Здания;		
		ИначеЕсли ГруппаОС = "ДвижимыеСооружения" Тогда
			НовОбъектУчета.ГруппаОС = Перечисления.ГруппыОС.Сооружения; 		
		// КОНЕЦ Белоконенко Денис 15.07.2024 Выполнение задач №000050219	
		Иначе
			Попытка
				НовОбъектУчета.ГруппаОС = Перечисления.ГруппыОС[ГруппаОС];
			Исключение
				НовОбъектУчета.ГруппаОС = Перечисления.ГруппыОС.ДругиеВидыОсновныхСредств;
			КонецПопытки 			
		КонецЕсли;
	Иначе
		НовОбъектУчета = Справочники.НематериальныеАктивы.СоздатьЭлемент();
		НовОбъектУчета.УстановитьСсылкуНового(Результат);
		НовОбъектУчета.Код = СокрЛП(СтрДанные.ОбъектУчетаКод);
		НовОбъектУчета.Наименование = СтрДанные.ОбъектУчетаНаименование;
		НовОбъектУчета.АмортизационнаяГруппа = ПреобразоватьЗначениеИзСтроки(СтрДанные.ОбъектУчетаАмортизационнаяГруппа, 
					"Перечисление", "АмортизационныеГруппы");
		НовОбъектУчета.ВидНМА = ПреобразоватьЗначениеИзСтроки(СтрДанные.ОбъектУчетаВидНМА, "Перечисление", "ВидыНМА");
		НовОбъектУчета.ВидОбъектаУчета = ПреобразоватьЗначениеИзСтроки(СтрДанные.ОбъектУчетаВидОбъектаУчета, 
					"Перечисление", "ВидыОбъектовУчетаНМА"); 
	КонецЕсли;
	
	Попытка
		НовОбъектУчета.Записать();
	Исключение
		НовОбъектУчета.ОбменДанными.Загрузка = Истина;
		НовОбъектУчета.Записать();
	КонецПопытки;
	
	//Результат = НовОбъектУчета.Ссылка;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	ЗагрузитьНаСервере(АдресХранилища, ДатаДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыборФайла", ЭтаФорма);
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр = "(*.xlsx)|*.xlsx";
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если Не ВыбранныеФайлы = Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];	
	КонецЕсли;
	
КонецПроцедуры

// Белоконенко Денис 04.12.2023 Выполнение задач №000047710
&НаСервере
Процедура ПерезаписатьИнвентарныеНомераНаСервере(АдресХранилища)
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ВремИмяФайла = ПолучитьИмяВременногоФайла(".xlsx");
	ДвоичныеДанные.Записать(ВремИмяФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ВремИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокумент.Область(4,2, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
	Построитель.Выполнить();
	ТаблицаЗначений = Построитель.Результат.Выгрузить();
	УдалитьФайлы(ВремИмяФайла);
	
	ДокументОбъект = Неопределено;
	ЭтоОС = Неопределено;
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//ТекущаяДата = ТекущаяДата();   
	ТекущаяДата = ТекущаяДатаСервера();
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	Дата = ?(ЗначениеЗаполнено(ДатаДокументов),КонецДня(ДатаДокументов), ТекущаяДата);
	Комментарий = "#Перенос остатков ОС и НМА "+ТекущаяДата;		
	УправленческаяОрганизация = Справочники.Организации.УправленческаяОрганизация;
	ГруппаФинансовогоУчетаОС = ПолучитьГруппуФинансовогоУчета("ОС", Перечисления.ВидыВнеоборотныхАктивов.ОсновноеСредство);
	ГруппаФинансовогоУчетаНМА = ПолучитьГруппуФинансовогоУчета("НМА", Перечисления.ВидыВнеоборотныхАктивов.НМА);
	ГруппаФинансовогоУчетаНИКОР = ПолучитьГруппуФинансовогоУчета("НИКОР", Перечисления.ВидыВнеоборотныхАктивов.НИОКР);
	СтруктураЗаполнения = Новый Структура("Организация, Местонахождение, ОтражатьВБУиНУ, ОтражатьВУУ, ХозяйственнаяОперация, Комментарий, Завершен",
			,,,,,Комментарий, Ложь);
			
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("ДокументОбъект");
	Для Каждого КлючИЗначение Из СтруктураЗаполнения Цикл
		ТаблицаДокументов.Колонки.Добавить(КлючИЗначение.Ключ);	
	КонецЦикла;
	
	Для Каждого Стр Из ТаблицаЗначений Цикл
		
		Если ПустаяСтрока(Стр.ОбъектУчета) Тогда
			Продолжить;
		КонецЕсли;	
		
		//Заполняются основные реквизиты для определения документа
		ЭтоОС = Стр.ЭтоОС = "Да";
					
		ПерезаписатьОбъектУчета(Стр, ЭтоОС);
				
	КонецЦикла;
				
	ОбщегоНазначения.СообщитьПользователю("Запись завершена");
КонецПроцедуры

// Белоконенко Денис 04.12.2023 Выполнение задач №000047710
&НаСервереБезКонтекста
Процедура ПерезаписатьОбъектУчета(СтрДанные, ЭтоОС)
	
	Результат = Неопределено;
	
	Если ЭтоОС Тогда
		Результат = ПреобразоватьЗначениеИзСтроки(СтрДанные.ОбъектУчета, "Справочник", "ОбъектыЭксплуатации");	
	Иначе
		Результат = ПреобразоватьЗначениеИзСтроки(СтрДанные.ОбъектУчета, "Справочник", "НематериальныеАктивы");		
	КонецЕсли;
	
	//Проверка на пустую ссылку или объект не найден
	Если (Результат.Пустая()
		ИЛИ Результат.ПолучитьОбъект() = Неопределено) Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЭтоОС Тогда
		
		НовОбъектУчета = Результат.ПолучитьОбъект();
		НовОбъектУчета.Код = СокрЛП(СтрДанные.ОбъектУчетаКод);
		НовОбъектУчета.ИнвентарныйНомер = СокрЛП(СтрДанные.ОбъектУчетаКод);
		
		Попытка
			НовОбъектУчета.Записать();
		Исключение
			НовОбъектУчета.ОбменДанными.Загрузка = Истина;
			НовОбъектУчета.Записать(); 
			
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры


// Белоконенко Денис 04.12.2023 Выполнение задач №000047710
&НаКлиенте
Процедура ПерезаписатьИнвентарныеНомера(Команда)
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	
	ПерезаписатьИнвентарныеНомераНаСервере(АдресХранилища);
КонецПроцедуры

// Белоконенко Денис 15.07.2024 Выполнение задач №000050219
&НаСервере
Процедура ЗагрузитьИзменениеПараметровНаСервере(АдресХранилища)
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ВремИмяФайла = ПолучитьИмяВременногоФайла(".xlsx");
	ДвоичныеДанные.Записать(ВремИмяФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ВремИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокумент.Область(4,2, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
	Построитель.Выполнить();
	ТаблицаЗначений = Построитель.Результат.Выгрузить();
	УдалитьФайлы(ВремИмяФайла);

	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//ТекущаяДата = ТекущаяДата(); 
	ТекущаяДата = ТекущаяДатаСервера();
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	Дата = ?(ЗначениеЗаполнено(ДатаДокументов), ДатаДокументов, ТекущаяДата);
		
	УправленческаяОрганизация = Справочники.Организации.УправленческаяОрганизация;
	// НАЧАЛО Белоконенко Денис 11.04.2025 Выполнение задач №000053383
	//СтруктураЗаполнения = Новый Структура("Дата, ЭтоОС, Организация, Подразделение, СтатьяРасходов",
	СтруктураЗаполнения = Новый Структура("Дата, ЭтоОС, Организация, Подразделение, СтатьяРасходов, ОтражатьВБУ, ОтражатьВНУ, ОтражатьВРеглУчете, ОтражатьВУпрУчете",
	// КОНЕЦ Белоконенко Денис 11.04.2025 Выполнение задач №000053383
			Дата);
			
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("ДокументОбъект");
	Для Каждого КлючИЗначение Из СтруктураЗаполнения Цикл
		ТаблицаДокументов.Колонки.Добавить(КлючИЗначение.Ключ);	
	КонецЦикла;
	
	// НАЧАЛО Иванов ВЮ (Код-Эксперт) 21.02.2025 Выполнение задач №000052552
	Если ОтсутствуютОбязательныеКолонкиВФайле(ТаблицаЗначений) Тогда
		Возврат;
	КонецЕсли;
	// КОНЕЦ Иванов ВЮ (Код-Эксперт) 21.02.2025 Выполнение задач №000052552
	
	Для Каждого Стр Из ТаблицаЗначений Цикл
		
		Если ПустаяСтрока(Стр.ОбъектУчета) Тогда
			Продолжить;
		КонецЕсли;			
		
		// НАЧАЛО Белоконенко Денис 11.04.2025 Выполнение задач №000053383
		ОтраженВБУ = ПреобразоватьЗначениеИзСтроки(Стр.ОтраженВБУ, "Булево");
		ОтраженВНУ = ПреобразоватьЗначениеИзСтроки(Стр.ОтраженВНУ, "Булево");
		ОтраженВУУ = ПреобразоватьЗначениеИзСтроки(Стр.ОтраженВУУ, "Булево");
		
		Если Не ОтраженВБУ И Не ОтраженВНУ Тогда
			ОтражатьВРеглУчете = Ложь;
		Иначе
			ОтражатьВРеглУчете = Истина;			
		КонецЕсли;
		
		СтруктураЗаполнения.ОтражатьВБУ			= ОтраженВБУ;
		СтруктураЗаполнения.ОтражатьВНУ			= ОтраженВНУ;
		СтруктураЗаполнения.ОтражатьВРеглУчете 	= ОтражатьВРеглУчете;
		СтруктураЗаполнения.ОтражатьВУпрУчете 	= ОтраженВУУ;
		// КОНЕЦ Белоконенко Денис 11.04.2025 Выполнение задач №000053383	
		
		ЭтоОС = Стр.ЭтоОС = "Да";
		
		Если ЗначениеЗаполнено(Стр.Организация) Тогда
			Организация = ПреобразоватьЗначениеИзСтроки(Стр.Организация, "Справочник", "Организации");
		Иначе
			Организация = УправленческаяОрганизация;
		КонецЕсли;		
		СтруктураЗаполнения.Организация = Организация;
		
		Подразделение 	= ПреобразоватьЗначениеИзСтроки(Стр.Подразделение, "Справочник", "СтруктураПредприятия");
		Если СокрЛП(Стр.КодСтатьиЕРП_УХ) = "" Тогда
			СтатьяРасходов = СтатьяРасходовПоУмолчанию;
		Иначе
			СтатьяРасходов = ТН_Интеграция_ERP_УХ.СтатьяРасходовПоКоду(СокрЛП(Стр.КодСтатьиЕРП_УХ)); 
		КонецЕсли;
		СтруктураЗаполнения.Подразделение 	= Подразделение;
		СтруктураЗаполнения.СтатьяРасходов 	= СтатьяРасходов; 
		СтруктураЗаполнения.ЭтоОС 			= ЭтоОС;
		
		//Поиск объекта учета 
		Если ЭтоОС Тогда
			ОбъектУчета = ПреобразоватьЗначениеИзСтроки(Стр.ОбъектУчета, "Справочник", "ОбъектыЭксплуатации");	
		Иначе
			ОбъектУчета = ПреобразоватьЗначениеИзСтроки(Стр.ОбъектУчета, "Справочник", "НематериальныеАктивы");		
		КонецЕсли;
		
		//Проверка на пустую ссылку или объект не найден
		Если ОбъектУчета.Пустая()
			Или ОбъектУчета.ПолучитьОбъект() = Неопределено Тогда 
			ОбщегоНазначения.СообщитьПользователю("Не найден ОбъектУчета по гуиду " + Стр.ОбъектУчета);
			Продолжить;	
		КонецЕсли;		
		
		//Поиск документа
		НайденыДокументы = ТаблицаДокументов.НайтиСтроки(СтруктураЗаполнения);
		Если НайденыДокументы.Количество() = 0 Тогда
			
			Если ЭтоОС Тогда
				ДокументОбъект 	= Документы.ИзменениеПараметровОС2_4.СоздатьДокумент();
				ДокументОбъект.ОтражениеАмортизационныхРасходовФлаг = Истина;
				
				СтрокаТЧ_ОС 		 = ДокументОбъект.ОС.Добавить();
				СтрокаТЧ_Амортизация = ДокументОбъект.Амортизация.Добавить();
			Иначе
				ДокументОбъект 	= Документы.ИзменениеПараметровНМА2_4.СоздатьДокумент();
				// НАЧАЛО Белоконенко Денис 11.04.2025 Выполнение задач №000053383
				ДокументОбъект.ОтражениеАмортизационныхРасходовФлаг = Истина;
				// КОНЕЦ Белоконенко Денис 11.04.2025 Выполнение задач №000053383
				
				СтрокаТЧ_ОС 		 = ДокументОбъект.НМА.Добавить();
				СтрокаТЧ_Амортизация = ДокументОбъект.Амортизация.Добавить();
			КонецЕсли;	
			
			ТекДокСтр = ТаблицаДокументов.Добавить();
			ТекДокСтр.ДокументОбъект = ДокументОбъект;
			ЗаполнитьЗначенияСвойств(ТекДокСтр, СтруктураЗаполнения);
			
		Иначе
			ТекДокСтр = НайденыДокументы[0];
			ДокументОбъект = ТекДокСтр.ДокументОбъект;
			Если ЭтоОС Тогда				
				СтрокаТЧ_ОС 		 = ДокументОбъект.ОС.Добавить();
				СтрокаТЧ_Амортизация = ДокументОбъект.Амортизация[0];
			Иначе
				СтрокаТЧ_ОС 		 = ДокументОбъект.НМА.Добавить();
				СтрокаТЧ_Амортизация = ДокументОбъект.Амортизация[0];
			КонецЕсли;
		КонецЕсли; 
		
		// НАЧАЛО Белоконенко Денис 11.04.2025 Выполнение задач №000053383
		//ДокументОбъект.ОтражатьВУпрУчете 	= Истина;
		//ДокументОбъект.ОтражатьВРеглУчете 	= Истина;
		//ДокументОбъект.ОтражатьВБУ          = Истина;
		// КОНЕЦ Белоконенко Денис 11.04.2025 Выполнение задач №000053383
		ДокументОбъект.СуммаКоэффициентовАмортизации = 1;
		Комментарий = "#Перенос СпособыОтраженияРасходовПоАмортизации ОС и НМА: " + ТекущаяДата;
		ДокументОбъект.Комментарий = Комментарий;
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, СтруктураЗаполнения);
		
		//Заполнение табличной части
		
		// ТЧ ОС
		Если ЭтоОС Тогда
			СтрокаТЧ_ОС.ОсновноеСредство 	= ОбъектУчета;	
		Иначе
			СтрокаТЧ_ОС.НематериальныйАктив = ОбъектУчета;		
		КонецЕсли; 	
		
		// ТЧ Амортизация				
		СтрокаТЧ_Амортизация.Подразделение = СтруктураЗаполнения.Подразделение;
		СтрокаТЧ_Амортизация.СтатьяРасходов = СтруктураЗаполнения.СтатьяРасходов;
		СтрокаТЧ_Амортизация.АналитикаРасходов = СтруктураЗаполнения.Подразделение;
		СтрокаТЧ_Амортизация.ПередаватьРасходыВДругуюОрганизацию = Ложь;
		СтрокаТЧ_Амортизация.Коэффициент = 1; 
				
	КонецЦикла;
		
	Для Каждого ТекДокСтр Из ТаблицаДокументов Цикл
		ДокументОбъект = ТекДокСтр.ДокументОбъект;
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокументОбъект.УстановитьНовыйНомер();
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначения.СообщитьПользователю("Ошибка проведения документа " + ДокументОбъект.Ссылка, ДокументОбъект.Ссылка);
		КонецПопытки;
	КонецЦикла;
		
	ОбщегоНазначения.СообщитьПользователю("Загрузка завершена. Создано документов: " + ТаблицаДокументов.Количество());
	

КонецПроцедуры

// Иванов ВЮ (Код-Эксперт) 21.02.2025 Выполнение задач №000052552
&НаСервере
Функция ОтсутствуютОбязательныеКолонкиВФайле(ТаблицаЗначений)
	
	Колонки = ТаблицаЗначений.Колонки;
	
	Если КолонкаОтсутствует(Колонки, "ОбъектУчета") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если КолонкаОтсутствует(Колонки, "ЭтоОС") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если КолонкаОтсутствует(Колонки, "Организация") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если КолонкаОтсутствует(Колонки, "Подразделение") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если КолонкаОтсутствует(Колонки, "КодСтатьиЕРП_УХ") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ОтсутствуютОбязательныеКолонкиВФайле()

// Иванов ВЮ (Код-Эксперт) 21.02.2025 Выполнение задач №000052552
&НаСервере
Функция КолонкаОтсутствует(Колонки, ИмяКолонки)
	
	Если Колонки.Найти(ИмяКолонки) = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В файле отсутствует колонка ""%1"".", ИмяКолонки));
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // КолонкаОтсутствует()

// Белоконенко Денис 15.07.2024 Выполнение задач №000050219
&НаКлиенте
Процедура ЗагрузитьИзменениеПараметров(Команда)
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	
	ЗагрузитьИзменениеПараметровНаСервере(АдресХранилища);
КонецПроцедуры

// Белоконенко Денис 11.04.2025 Выполнение задач №000053383
&НаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыПоСпособуРасходов(СтрокаТаблицы)   
	
	// БУ
	ВнеоборотныеАктивыКлиентСервер.ЗаполнитьПоСпособуОтраженияРасходов(
		СтрокаТаблицы.СпособОтраженияРасходовБУ, 
		СтрокаТаблицы.СтатьяРасходовБУ, 
		СтрокаТаблицы.АналитикаРасходовБУ, 
		СтрокаТаблицы.ПодразделениеБУ, 
		СтрокаТаблицы.НаправлениеДеятельностиБУ, 
		СтрокаТаблицы.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ);
		
	// УУ
	ВнеоборотныеАктивыКлиентСервер.ЗаполнитьПоСпособуОтраженияРасходов(
		СтрокаТаблицы.СпособОтраженияРасходовУУ, 
		СтрокаТаблицы.СтатьяРасходовУУ, 
		СтрокаТаблицы.АналитикаРасходовУУ, 
		СтрокаТаблицы.ПодразделениеУУ, 
		СтрокаТаблицы.НаправлениеДеятельностиУУ, 
		СтрокаТаблицы.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ);
		
	// НУ
	ВнеоборотныеАктивыКлиентСервер.ЗаполнитьПоСпособуОтраженияРасходов(
		СтрокаТаблицы.СпособОтраженияРасходовНУ, 
		СтрокаТаблицы.СтатьяРасходовНУ, 
		СтрокаТаблицы.АналитикаРасходовНУ, 
		СтрокаТаблицы.ПодразделениеНУ, 
		СтрокаТаблицы.НаправлениеДеятельностиНУ, 
		СтрокаТаблицы.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаНУ);		
		
КонецПроцедуры
